Информационная_база/src/Documents/НачислениеСписаниеБонусныхБаллов/НачислениеСписаниеБонусныхБаллов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеСписаниеБонусныхБаллов</name>
  <registerRecords>AccumulationRegister.БонусныеБаллы</registerRecords>
  <registerRecords>AccumulationRegister.НачисленияБонусныхБаллов</registerRecords>
  <attributes>
    <name>БонуснаяПрограмма</name>
    <type>
      <types>CatalogRef.БонусныеПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СлужебныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомлениеОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НачисленияБонусов</name>
    <attributes>
      <name>БонуснаяКарта</name>
      <type>
        <types>CatalogRef.ДисконтныеКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаНачисленияБонусов</name>
      <type>
        <types>CatalogRef.АналитикаНачисленияБонусов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачисления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСгорания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписанияБонусов</name>
    <attributes>
      <name>БонуснаяКарта</name>
      <type>
        <types>CatalogRef.ДисконтныеКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КорректировкаКСписанию</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Информационная_база/src/Documents/НачислениеСписаниеБонусныхБаллов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаНачислениеСписаниеБонусныхБаллов, СтруктураДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеСписаниеБонусныхБалловНачисленияБонусов.НомерСтроки КАК НомерСтроки,
	|	НачислениеСписаниеБонусныхБалловНачисленияБонусов.Ссылка.Дата КАК Период,
	|	НачислениеСписаниеБонусныхБалловНачисленияБонусов.БонуснаяКарта КАК БонуснаяКарта,
	|	НачислениеСписаниеБонусныхБалловНачисленияБонусов.АналитикаНачисленияБонусов КАК АналитикаНачисленияБонусов,
	|	НачислениеСписаниеБонусныхБалловНачисленияБонусов.Количество КАК Количество,
	|	НачислениеСписаниеБонусныхБалловНачисленияБонусов.ДатаНачисления КАК ДатаНачисления,
	|	НачислениеСписаниеБонусныхБалловНачисленияБонусов.ДатаСгорания КАК ДатаСгорания,
	|	НачислениеСписаниеБонусныхБалловНачисленияБонусов.Ссылка КАК Ссылка,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика
	|ПОМЕСТИТЬ ВременнаяТаблицаНачисленияБонусов
	|ИЗ
	|	Документ.НачислениеСписаниеБонусныхБаллов.НачисленияБонусов КАК НачислениеСписаниеБонусныхБалловНачисленияБонусов
	|ГДЕ
	|	НачислениеСписаниеБонусныхБалловНачисленияБонусов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачислениеСписаниеБонусныхБалловСписанияБонусов.НомерСтроки КАК НомерСтроки,
	|	НачислениеСписаниеБонусныхБалловСписанияБонусов.Ссылка.Дата КАК Период,
	|	НачислениеСписаниеБонусныхБалловСписанияБонусов.БонуснаяКарта КАК БонуснаяКарта,
	|	НачислениеСписаниеБонусныхБалловСписанияБонусов.Количество КАК Количество,
	|	НачислениеСписаниеБонусныхБалловСписанияБонусов.КорректировкаКСписанию КАК КСписанию,
	|	НачислениеСписаниеБонусныхБалловСписанияБонусов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВременнаяТаблицаСписанияБонусов
	|ИЗ
	|	Документ.НачислениеСписаниеБонусныхБаллов.СписанияБонусов КАК НачислениеСписаниеБонусныхБалловСписанияБонусов
	|ГДЕ
	|	НачислениеСписаниеБонусныхБалловСписанияБонусов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаНачислениеСписаниеБонусныхБаллов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СформироватьТаблицаБонусныеБаллы(ДокументСсылкаНачислениеСписаниеБонусныхБаллов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаНачисленияБонусныхБаллов(ДокументСсылкаНачислениеСписаниеБонусныхБаллов, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значение, содержащую данные для проведения по регистру.
// Таблицу значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаБонусныеБаллы(ДокументСсылкаНачислениеСписаниеБонусныхБаллов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = РаботаСБонусами.СформироватьТекстЗапросаПоБонуснымБаллам();
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаБонусныеБаллы = РезультатЗапроса[0].Выгрузить();
	ТаблицаОплатаБонусами = РезультатЗапроса[1].Выгрузить();
	
	Для Каждого СтрокаОплаты Из ТаблицаОплатаБонусами Цикл
		НоваяСтрока = ТаблицаБонусныеБаллы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОплаты);
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаБонусныеБаллы", ТаблицаБонусныеБаллы);
	
КонецПроцедуры

Процедура СформироватьТаблицаНачисленияБонусныхБаллов(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства)
	
	Если ДокументСсылкаОтчетОРозничныхПродажах.НачисленияБонусов.Количество() = 0 Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНачисленияБонусныхБаллов", Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = РаботаСБонусами.СформироватьТекстЗапросаПоНачислениямБонусныхБаллов();
	ТаблицаНачисленияБонусныхБаллов = Запрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНачисленияБонусныхБаллов", ТаблицаНачисленияБонусныхБаллов);
	
КонецПроцедуры

#КонецЕсли
